.svn/pristine/a1/a12f6a11094fa7d06d06b2bbb6e930361161d7fb.svn-base

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns1:postXML xmlns:ns1="http://webservice.bodoglive.integration.irc.live.bodog/"><arg0><![CDATA[<BroadcastDataSet xmlns="http://pxpsystems.com/BroadcastDataSet.xsd">

  <Game>
    <gameid>${gameid}</gameid>
    <hteamid>${hteamid}</hteamid>
    <vteamid>${vteamid}</vteamid>
    <hteamname>${hteamname}</hteamname>
    <hteamnickname>${hteamnickname}</hteamnickname>
    <hteamabbrev>${hteamabbrev}</hteamabbrev>
    <vteamname>${vteamname}</vteamname>
    <vteamnickname>${vteamnickname}</vteamnickname>
    <vteamabbrev>${vteamabbrev}</vteamabbrev>
    <gamedateUTC>${gamedateUTC}</gamedateUTC>
    <admintype>${admintype}</admintype>
    <leagueName>${leagueName}</leagueName>
    <leagueId>${leagueId}</leagueId>
    <displayAwayTeamFirst>${displayAwayTeamFirst}</displayAwayTeamFirst>
    <eventDescription>${eventDescription}</eventDescription>
    <Line>
      <lineid>${lineid}</lineid>
      <marketid>${marketid}</marketid>
      <mainMarketTypeId>${mainMarketTypeId}</mainMarketTypeId>
      <issuspended>${issuspended}</issuspended>
      <scoreboardid>${scoreboardid}</scoreboardid>
      <gameid>${gameid}</gameid>
      <displaytext>${displaytext}</displaytext>
      <propid>${propid}</propid>
      <proptypeid>${proptypeid}</proptypeid>
      <isExpandedByDefaultMobile>${isExpandedByDefaultMobile}</isExpandedByDefaultMobile>
      <isExpandedByDefaultWeb>${isExpandedByDefaultWeb}</isExpandedByDefaultWeb>
      <displayInSportsLiveCoupons>${displayInSportsLiveCoupons}</displayInSportsLiveCoupons>
      <LineOutcome>
        <lineid>${lineid1}</lineid>
        <outcomeid>${outcomeid1}</outcomeid>
        <displaytext>${displaytext1}</displaytext>
        <risk>${risk1}</risk>
        <win>${win1}</win>
        <issuspended>${issuspended1}</issuspended>
        <outcomeTypeId>${outcomeTypeId1}</outcomeTypeId>
      </LineOutcome>
      <LineOutcome>
        <lineid>${lineid2}</lineid>
        <outcomeid>${outcomeid2}</outcomeid>
        <displaytext>${displaytext2}</displaytext>
        <risk>${risk2}</risk>
        <win>${win2}</win>
        <issuspended>${issuspended2}</issuspended>
        <outcomeTypeId>${outcomeTypeId2}</outcomeTypeId>
      </LineOutcome>
      <LineOutcome>
        <lineid>${lineid3}</lineid>
        <outcomeid>${outcomeid3}</outcomeid>
        <displaytext>${displaytext3}</displaytext>
        <risk>${risk3}</risk>
        <win>${win3}</win>
        <issuspended>${issuspended3}</issuspended>
        <outcomeTypeId>${outcomeTypeId3}</outcomeTypeId>
      </LineOutcome>
    </Line>
    <Scoreboard>
      <scoreboardid>${scoreboardid}</scoreboardid>
      <gameid>${gameid}</gameid>
      <vscore>${vscore}</vscore>
      <hscore>${hscore}</hscore>
      <period>${period}</period>
      <gametime>${gametime}</gametime>
      <gamestatus>${gamestatus}</gamestatus>
      <messageage>${message}</messageage>
      <ScoreboardSoccer>
        <scoreboardid>${scoreboardid}</scoreboardid>
        <phasename>${phasename}</phasename>
        <homecorners>${homecorners}</homecorners>
        <homeyellowcards>${homeyellowcards}</homeyellowcards>
        <homeredcards>${homeredcards}</homeredcards>
        <awaycorners>${awaycorners}</awaycorners>
        <awayyellowcards>${awayyellowcards}</awayyellowcards>
        <awayredcards>${awayredcards}</awayredcards>
        <stoppagetimeseconds>${stoppagetimeseconds}</stoppagetimeseconds>
      </ScoreboardSoccer>
    </Scoreboard>
  </Game>
</BroadcastDataSet>]]></arg0><arg1>177</arg1></ns1:postXML>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>